Revit 2027 API
IFCOpeningDimensions.HasRectangularDimensions Property
 True if width and height are valid, false if only area is valid.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool HasRectangularDimensions { get; set; }
Public Property HasRectangularDimensions As Boolean
	Get
	Set
public:
property bool HasRectangularDimensions {
	bool get ();
	void set (bool value);
}
member HasRectangularDimensions : bool with get, set
Property Value
Boolean
See Also
Reference
IFCOpeningDimensions Class
Autodesk.Revit.DB.IFC Namespace